{
  "name": "Le Canh Hung",
  "title": "Web Developer",
  "school": "Duy Tan University",
  "email": "lecanhhung0410@gmail.com",
  "phone": "0935718178",
  "address": "Da Nang, Vietnam",

  "menu_intro": "Introduction",
  "menu_skills": "Skills",
  "menu_routes": "Career Path",
  "menu_projects": "Personal Projects",

  "intro_title": "Introduction",
  "intro_paragraph1": "Hello! I’m a student passionate about building modern and optimized web experiences. I have experience developing web applications using modern technologies such as Next.js and Nest.js, always focusing on performance and user experience.",
  "intro_paragraph2": "I am particularly skilled at leveraging AI to support the software development process—from crafting effective prompts, managing and refining AI-generated code, to integrating AI into the workflow for better productivity and performance.",
  "intro_paragraph3": "I have some experience in building and deploying several small-scale real-world websites. These projects have given me valuable lessons and helped me recognize my shortcomings. I am continuously improving my skills to become more aligned with the industry.",
  "intro_paragraph4": "Additionally, I have a fast learning ability, good adaptability to new environments, and effective communication skills. I can use English at an intermediate level for basic listening and speaking, and I’m eager to further improve my English for professional use.",

  "skills_title": "Skills",
  "skills_tab1": "Programming Skills",
  "skills_tab2": "Language Skills",
  "skills_code_title": "Programming Languages",
  "skills_js_desc": "Used TypeScript in Next.js projects, handled state and props, worked with APIs.",
  "skills_cpp_desc": "Used C++ to implement basic algorithms.",
  "skills_csharp_desc": "Experienced in using C# to build Windows Forms applications.",
  "skills_java_desc": "Worked with Java OOP for small personal projects.",
  "skills_web_title": "Web Technologies",
  "skills_next_desc": "Used TypeScript in Next.js, managed state and props, and handled APIs.",
  "skills_nest_desc": "Used NestJS to build backend API services.",
  "skills_dotnet_desc": "Built Windows Forms applications during study.",
  "skills_javaswing_desc": "Used Java Core/Swing in small personal projects.",
  "skills_english_title": "English",
  "skills_listen_title": "Listening",
  "skills_listen_desc": "Able to understand basic spoken English in conversations.",
  "skills_speak_title": "Speaking",
  "skills_speak_desc": "Can communicate effectively in simple conversations.",
  "skills_read_title": "Reading",
  "skills_read_desc": "Able to read and understand general English texts.",
  "skills_write_title": "Writing",
  "skills_write_desc": "Able to write simple English sentences and paragraphs.",

  "basic_level": "Basic",
  "intermediate_level": "Intermediate",
  "good_level": "Good",
  "advanced_level": "Advanced",

  "routes_title": "Career Path",
  "routes_goal": "Fullstack Web Developer",
  "routes_description": "With the knowledge and experience I’ve gained through study and practice, my goal is to become a Fullstack Web Developer.",

  "projects_title": "Personal Projects",
  "project1_name": "Project: FoodPin",
  "project1_desc": "FoodPin is a website designed for F&B businesses to showcase their menus, and for customers to discover their favorite dishes. Built with Next.js, this was my first full Next.js project. Though imperfect, it was a great motivation to grow.",
  "project2_name": "Project: Languages Translation Practice",
  "project2_desc": "This website was created for myself and some friends to practice grammar by translating sentences from Vietnamese into foreign languages. It uses Gemini API to handle translations and display results.",
  "project3_name": "Project: Moon Light Spa",
  "project3_desc": "This was my first real-world project — a small-scale website for a spa. It may not be a big achievement, but it marked an important step in my personal development."
}
